benchmarks/ringo-node/string-alloc/node.out
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        
Server Hostname:        0.0.0.0
Server Port:            8001

Document Path:          //
Document Length:        1024 bytes

Concurrency Level:      50
Time taken for tests:   23.851 seconds
Complete requests:      50000
Failed requests:        0
Write errors:           0
Total transferred:      54400000 bytes
HTML transferred:       51200000 bytes
Requests per second:    2096.38 [#/sec] (mean)
Time per request:       23.851 [ms] (mean)
Time per request:       0.477 [ms] (mean, across all concurrent requests)
Transfer rate:          2227.40 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     1   24  13.1     23      60
Waiting:        1   24  13.1     23      60
Total:          1   24  13.1     23      60

Percentage of the requests served within a certain time (ms)
  50%     23
  66%     31
  75%     35
  80%     37
  90%     42
  95%     46
  98%     48
  99%     48
 100%     60 (longest request)