benchmarks/ringo-node/string-alloc/ringo.out
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        Jetty(7.1.6.v20100715)
Server Hostname:        0.0.0.0
Server Port:            8001

Document Path:          //
Document Length:        1024 bytes

Concurrency Level:      50
Time taken for tests:   15.748 seconds
Complete requests:      50000
Failed requests:        0
Write errors:           0
Total transferred:      58045240 bytes
HTML transferred:       51239936 bytes
Requests per second:    3175.02 [#/sec] (mean)
Time per request:       15.748 [ms] (mean)
Time per request:       0.315 [ms] (mean, across all concurrent requests)
Transfer rate:          3599.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    7   1.9      7      19
Processing:     1    8   2.6      8      39
Waiting:        0    7   2.7      6      37
Total:          1   16   2.1     15      45

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     15
  75%     16
  80%     16
  90%     17
  95%     19
  98%     22
  99%     24
 100%     45 (longest request)